app/controllers/blogs_controller.rb

INSERT INTO "blogs" ("title", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["title", "the blog 1"], ["created_at", "2023-11-09 06:14:37.246576"], ["updated_at", "2023-11-09 06:14:37.246576"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    @blog.destroy!