app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolios = Portfolio.all

SELECT "comments".* FROM "comments" WHERE "comments"."portfolio_id" = ?  [["portfolio_id", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @portfolio = Portfolio.includes(:comments).find(params[:id])

INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
  def create
    @portfolio = Portfolio.new(portfolio_params)

    respond_to do |format|
      if @portfolio.save

DELETE FROM "portfolios" WHERE "portfolios"."id" = ?  [["id", 9]]
---
  def destroy
    @portfolio.destroy!

SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_portfolio
      @portfolio = Portfolio.find(params[:id])